{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"Norman Fucking Rockwell!&#58; Coexisting Hope &amp; Despair","permalink":"/blog/nfr","updated":"May 17, 2020","category":"Music","description":"It's getting warmer in Los Angeles (which makes me miss, somewhat, the chilly mornings when I had to wake up at 6 to attend Zoom University — how masochistic of me). Summer is coming, the best batch of loquat is ready for picking, the six-feet-apart-crosses-marked line at Costco, well, probably hasn't shrunk but subconsciously seems shorter. After all, it's not just you and me who are not going anywhere: \"no one's going anywhere,\" and as Lana famously said: \"the culture is lit.\""},"id":"2b923d4b-da33-5c34-af1b-6448640e2d39","excerpt":"For me, a good Lana song does two things: 1) makes me fall asleep and 2) gives me edgy inspiration upon further examination (the next morning, as it usually turns out). So it should come as no surprise that The Next Best American Record happened to be the first song from Norman Fucking Rockwell! that I fell for — the nonsensical lyrics are so fun to decode, though they probably mean nothing, and…"}},{"node":{"frontmatter":{"title":"Corona, College, and Us","permalink":"/blog/corona","updated":"March 20, 2020","category":"Personal","description":"There was not a single soul in the station, so instead of waiting on the empty, eerie platform for the N train which never came, I dragged my suitcases up the stairs into the rain. It was cold. I was alone. My bags were drenched. But I enjoyed having the streets to myself — it felt regal, and I liked how the lights were blurred by downpour, then reflected by puddles, then shattered by droplets hitting the surface. Light On reminds me of the rain that night."},"id":"42fc1832-4572-5365-a0d3-e3afcd0eb799","excerpt":"The problematic thing about an international public health emergency that forces the closure of schools, restaurants, and social events, aside from the fact that I've been rotting away at home and can't even find solace in the slim chance that I might be able to go to Glastonbury over the summer since both Glastonbury and London and my study abroad program are likely cancelled, is the fact that I…"}},{"node":{"frontmatter":{"title":"Being Earnest","permalink":"/blog/earnest","updated":"March 04, 2020","category":"Personal","description":"The truth is, a lot of times, people don’t see you for who you are, rather, they see you for who they need you to be. Consequently, masking yourself in protective veneers is not going to be bothersome for other people as it would be for you: they don’t have the time nor the effort to discover the real you. Other people may never know that I was introverted, or that I loathed socialization— I was the one under pressure. You cannot decide what other people think of you, or what they see in you, but you can change how you act. It is our own responsibility to lead a genuine life, to be earnest."},"id":"a617c9b7-5765-5a80-8e93-c0fa3734f61a","excerpt":"“I don't like novels that end happily. They depress me so much.” I first learned about Oscar Wilde through his fairy tales. At a time when I was devouring kid’s books and graphic novels, his stories, with their tragic undertones, stood out to me among the likes of Cinderella and Thumbelina and especially Snow White, whom I absolutely despised because I thought she was useless and had no skills…"}},{"node":{"frontmatter":{"title":"Commencement Address&#58; Lessons I Learned","permalink":"/blog/graduation","updated":"June 01, 2019","category":"Personal","description":"So don't become discouraged when the suffocating reality comes crashing down. Sometimes dreams are broken to make space for new ones. They represent a direction, but they’re not always the destination. Perhaps we don’t grow toward them, or for them. We grow to exceed them. Maybe we’re not quite ready for them today, but I know we’ll be ready someday. If we don’t get there, we’ll get somewhere. And I hope that the belief in someday, the dream of somewhere, will be our solace in midst of the ceaseless cluelessness of life."},"id":"e7ff6e2e-4c5b-52be-a839-5294d9cd26e5","excerpt":"Ladies and gentlemen, teachers, administrators, Class of 2019:  \nGood evening. It is an absolute honor to be here. Six years ago, when I arrived in America, quite literally “fresh off the boat,” I never imagined I would be standing here. When I first stepped foot on Troy’s campus, I was entirely clueless about my future. Now, standing here at graduation, I know exactly the direction I'm going in…"}}]}}}