{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"Norman Fucking Rockwell!&#58; Coexisting Hope &amp; Despair","permalink":"/blog/nfr","updated":"May 17, 2020","category":"Music"},"id":"99c1d15e-4ea7-53ad-86e8-a8b5d81e416a","excerpt":"For me, a good Lana song does two things: 1) makes me fall asleep and 2) gives me edgy inspiration upon further examination (the next morning, as it usually turns out). So it should come as no surprise that The Next Best American Record happened to be the first song from Norman Fucking Rockwell! that I fell for — the nonsensical lyrics are so fun to decode, though they probably mean nothing, and the song drags on and on and on until it leaves me in the perfect slumber — enviable merits, I know…"}},{"node":{"frontmatter":{"title":"Corona, College, and Us","permalink":"/blog/corona","updated":"March 20, 2020","category":"Personal"},"id":"391b8292-4fec-5f5c-bbff-25daa4c31df8","excerpt":"The problematic thing about an international public health emergency that forces the closure of schools, restaurants, and social events, aside from the fact that I've been rotting away at home and can't even find solace in the slim chance that I might be able to go to Glastonbury over the summer since both Glastonbury and London and my study abroad program are likely cancelled, is the fact that I can't even listen to music in peace anymore. I've always found it interesting, the way we are…"}},{"node":{"frontmatter":{"title":"Suburbia","permalink":"/blog/suburbia","updated":"January 23, 2020","category":"Personal"},"id":"ececb1d3-43ee-5847-abc8-9addd2b512df","excerpt":"When it comes to goodbyes, I’m experienced, or so I thought. Last summer, I said goodbye to skipping school for a Starbucks run under the 90-degree California sun. Before that, I said goodbye to lunch under woven canopies that never stopped the rain from wetting our food. Further back, I said goodbye to the comforts of motherland and native tongue. Moving across the country for college? It’ll be a piece of cake, I told myself as I hugged my brother and bid farewell to my parents. Before I knew…"}},{"node":{"frontmatter":{"title":"Lover&#58; The Evolution of Taylor Swift","permalink":"/blog/lover","updated":"October 20, 2019","category":"Music"},"id":"b2173d63-b80c-5a2e-9507-e2f6522cef37","excerpt":"We all remember the vengeful spirit of Taylor Swift. From claiming that \"there's nothing I do better than revenge\" to \"bandaids don’t fix bullet holes,\" a certain part of her discography was dedicated to feuds and lost loves. Just two years ago, Taylor can be seen burning bridges and throwing shades, (in addition to being presumably dead) in the music video for \"Look What You Made Me Do.\" If reputation were a product of the venom and frustration that consumed her in the aftermaths of the Kim…"}},{"node":{"frontmatter":{"title":"Russian Doll&#58; It's Hard to Stay Alive","permalink":"/blog/russian-doll","updated":"June 24, 2019","category":"Television"},"id":"ae431d6f-7f3a-53ab-83be-1db98718a73c","excerpt":"You would think that after an entire school year of Nietzsche, Meursault, Godot, Kafka, Hemingway, and Like Water for Chocolate in International Baccalaureate English would be enough absurdist discussion for a while, if not an entire lifetime. But Russian Doll, the extremely odd, extremely beautiful, and extremely thought-provoking delight, proved to be just that piece of existentialism I never knew I needed. The sheer brilliance in the editing and cinematography is just the least of it: the…"}},{"node":{"frontmatter":{"title":"Commencement Address&#58; Lessons I Learned","permalink":"/blog/graduation","updated":"June 01, 2019","category":"Personal"},"id":"f11abd50-b57a-599a-bc59-a550408e5202","excerpt":"Ladies and gentlemen, teachers, administrators, Class of 2019:  \nGood evening. It is an absolute honor to be here. Six years ago, when I arrived in America, quite literally “fresh off the boat,” I never imagined I would be standing here. When I first stepped foot on Troy’s campus, I was entirely clueless about my future. Now, standing here at graduation, I know exactly the direction I'm going in life! Just kidding, I’m just as clueless as freshman year, but I do know that my experiences at Troy…"}}]}}}